import 'package:fitness_app/core/constants/color_const/color_const.dart';
import 'package:fitness_app/core/constants/navigation_const/navigation_const.dart';
import 'package:fitness_app/core/extension/text_lang_extension/lang_extension.dart';
import 'package:fitness_app/core/init/lang/locale_keys.g.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:flutter_svg/flutter_svg.dart';

class AboutPage extends StatelessWidget {
  const AboutPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: ColorConst.instance.scaffoldBackgroundColor,
        elevation: 0,
        centerTitle: true,
        leading: Padding(
          padding: EdgeInsets.all(8.0.w),
          child: GestureDetector(
            child: SvgPicture.asset(
              "assets/icons/Circle Left.svg",
            ),
            onTap: () {
              Navigator.pop(context);
            },
          ),
        ),
        title: Text(
          LocaleKeys.til_ozgartirish.t.toUpperCase(),
          style: TextStyle(
            color: ColorConst.instance.white,
            fontSize: 25.sp,
            fontWeight: FontWeight.w700,
          ),
        ),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(20.w),
          child: Column(
            children: [
              Text(
                """Ўзбекистон давлат жисмоний тарбия ва спорт университетининг “Гимнастика назарияси ва услубияти” кафедраси профессор ўқитувчилари Эштаев Анвар Курганович, Эштаев Сергей Анварович, Мусаев Бахром Бахтиерович, Сулейманов Мухаммад Амин Эркин ўғли туздилар. Ушбу лойиҳа “ҳаёт учун хавфсиз соғлом турмуш тарзини тарғиб қилувчи махсус машқлар мажмуи ва унинг мультимедиали электрон дастурий маҳсулотини яратиш” деб номланади.
  Қўлланилиш соҳаси – Жисмоний тарбия ва оммавий спорт.
Таклиф қилинган соғломлаштириш дастурининг самарадорлиги тасдиқланди.
Тадқиқот давомида соғломлаштириш дастури қуйидаги бўлимлардан ташкил топиши кераклиги аниқланди:
- меҳнат фаолиятининг ҳусусиятлари (меҳнат шароитлари, касблар гуруҳи, кун тартиби, жисмоний тарбия дақиқалари (паузалари);
- саломатлик ҳолати ва тана тузилишининг ҳусусиятлари (тана узунлиги (бўй), оғирлиги (вазн), сурункали касалликларнинг мавжудлиги);
- соғломлаштириш дастуридан амалиётда фойдаланиш (мажмуалар мазмуни, меъёри, машқлар таърифи, бажариш бўйича амалий тавсиялар, хатоларни тузатиш).
Тадқиқотлар 3 босқичда ўтказилди:
Тадқиқотнинг биринчи босқичида адабиёт маълумотлари таҳлил қилинди, тадқиқотнинг асосий йўналиши аниқланди, ишчи фараз (гепотеза) илгари сурилди, мақсад аниқланди ва тадқиқот вазифалари шакллантирилди. Соғломлаштирувчи жисмоний тарбия машғулотларини ташкил этилиши ва ўтказилиш ҳусусиятлари бўйича педагогик кузатув амалга оширилди, жисмоний тарбия ва спорт соҳасининг малакали мутаҳассислари орасида анкета сўровлари ўтказилди. Сўров асосида иш куни тартибида соғломлаштирувчи гимнастика машқларини муваффақиятли бажарилишга таъсир кўрсатувчи омиллар аниқланди. Анкета сўрови ва адабиёт манбаларидан олинган маълумотлар таҳлили асосида соғломлаштириш дастури ишлаб чиқилди. Дастур ҳар бир бўлимларида ўз вазифалари аниқланган ва услубларига мувофиқ воситалар танлаб олинган мобил илова кўринишида тақдим этилди. Ишлаб чиқилган мобил илова самарадорлиги тажриба давомида текширилди. 
Учинчи босқичда асосий педагогик тажриба ўтказилди. Тажриба мобайнида мобил иловадан фойдаланиш самарадорлигини текширилди, асосий тажриба асосида олинган маълумотлар статистик қайта ишлаб чиқилди ва кенг аҳоли қатламлари мобил иловадан унумли фойдаланиши бўйича услубий ва амалий тавсиялар ишлаб чиқилди. 
""",
                style: TextStyle(
                  color: ColorConst.instance.white,
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
